{
  "testing-variables": {},
  "paragraph": [
    {
      "type": "literal",
      "value": "Basic statistics such as corpus sizes, frequency of various semantic annotations, and information about the length of the extracted triples of OPIEC and its subcorpora are shown in Tab. 2. Roughly "
    },
    {
      "expression": "\"30%\"",
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " of the triples ("
    },
    {
      "expression": "\"104M\"",
      "type": "expression"
    },
    {
      "type": "literal",
      "value": ") in OPIEC are clean according to the above constraints. Table 2 shows that clean triples are generally shorter on average and tend to have a "
    },
    {
      "expression": "\"higher\"",
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " confidence score than the full set of triples in OPIEC. About "
    },
    {
      "expression": "\"49%\"",
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " of all triples in OPIEC contain some sort of semantic annotation (cf. Tab. 2); in OPIEC-Linked, the fraction increases to "
    },
    {
      "expression": "\"58\"",
      "type": "expression"
    },
    {
      "type": "literal",
      "value": "%.\n\nThe rest of the paragraph does not contain explicit values, comparative expressions, or superlative or aggregated expressions that would be replaced by Fluid expressions according to the given rules:\n\nMost of the semantic annotations referred to quantities, space or time; these annotations provide important context for the extractions. There is a significantly smaller amount of negative polarity and possibility modality annotations. One reason for the lack of such annotations may be in the nature of the Wikipedia articles, which aim to contain encyclopedic, factual statements and are thus more rarely negated or hedged."
    }
  ],
  "variables": {},
  "imports": [
    "scigen",
    "util",
    "datasets/scigenCL/_1904_12324v1_369"
  ],
  "datasets": ["datasets/scigenCL/1904.12324v1-369.json"]
}