{
  "testing-variables": {},
  "paragraph": [
    {
      "type": "literal",
      "value": "Table 2 and 3 compare the accuracies of our models to the results reported by several representative studies in frame-semantic parsing. As can be seen from the tables, "
    },
    {
      "expression": "\"PAFIBERT\"",
      "categories": ["data-retrieval"],
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " outperformed other models on both the in-domain Das's test set and the out-of-domain YAGS test set, yielding new state-of-the-art results for frame identification. As expected, the results obtained with LU-based frame filtering were slightly "
    },
    {
      "expression": "\"better\"",
      "categories": ["comparison"],
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " than those produced using target-based frame filtering, suggesting that a realistic setup is crucial in measuring model performance more precisely. On Das's test set, for example, PAFIBERT achieved absolute improvements of "
    },
    {
      "expression": "\"4-5%\"",
      "categories": ["data-retrieval"],
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " and "
    },
    {
      "expression": "\"9%\"",
      "categories": ["data-retrieval"],
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " with frame filtering (Table 2) and without frame filtering (Table 3) respectively. As reported by , frame identification models usually suffer a drastic drop in performance when tested on out-of-domain data. The same trend was observed in our experiments for the YAGS test set. Nevertheless, PAFIBERT still outperformed existing methods by a large margin on this out-of-domain test set. Besides, in the more challenging setup that involved no frame filtering, the results obtained by PAFIBERT were "
    },
    {
      "expression": "\"on par\"",
      "categories": ["comparison"],
      "type": "expression"
    },
    {
      "type": "literal",
      "value": " with the prior state-of-the-art accuracies achieved with frame filtering."
    }
  ],
  "variables": {},
  "imports": [
    "scigen",
    "util",
    "datasets/scigen_SuggestionAgent/_1910_14549v1_371"
  ],
  "datasets": ["datasets/scigen_SuggestionAgent/1910.14549v1-371.json"]
}